Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON KO>EN The Girl Downstairs.tmx
Source language: ko
Languages: en

source: 부러워~
en: So jealous...

source: 아냐, 유통기한 생각하면 이거 나 혼자 못 먹어!
en: It’s okay. I can’t finish them before the expiration date!

source: 누나랑은 주량이 잘 맞아
en: I can totally keep up with you.

source: 그건 또 그거대로 무척이나 행복하겠지만
en: ...that would be an incredibly happy scenario in its own right.

source: - 이라 최 해피 타임 폭망 -
en: ira choi’s happy time, doomed

source: 하트 왜 이렇게 많아?
en: Why are there so many likes?

source: 진짜 양평 가시게요?
en: father, you’re really going to yangpyeong?

source: 소곤
en: WHISPER

source: 쿵짝 쿵짝 쿵짝 쿵짝
en: THUNK THUNK THUNK THUNK

source: 취미 삼아 인O타에 올리던 영화 두 줄 평이 인기를 끌어,
en: ...a short film review she shared for fun on social media became increasingly popular.

source: 그렇게나 예쁘고 그렇게나 재능 넘치면서,
en: she’s so pretty and so talented...

source: …......{j}엥?
en: huuuh...?{j}

source: 재밌어~~ 봐봐!
en: it is fun! look at this!

source: 나{j}혼자 샤랄랄라{j}간다
en: Going Alone Beautiful{j}{j}

source: 거기도 쫌만 나가면 편의점 있고 마트 있고 있을 거 다 있어.
en: besides, there are convenience stores and big grocery stores nearby.

source: 이번 주 나 혼자 간다 게스트는 요즘 한창 뜨거운 아티스트,
en: this week’s guest on going alone is the hottest artist nowadays!

source: ㅎㅎ 귀여워서!
en: You’re adorable!

source: 너무 걱정하지 마.
en: Don’t lose sleep over it.

source: 구 셰어하우스팟(5)
en: Former housemates (5)

source: 윽;
en: Um.

source: 누난 장 봤나 보네
en: You must have finished grocery shopping.

source: 두근거리는 이야기를.
en: ...those stories that made our hearts pit-a-pat.

source: 어젠 엄마한테 짜증까지 내버렸어!
en: I even lashed out at my mom yesterday!

source: OT서 눈 맞아 사내연애 시작한 사람들이 잔뜩이거든~
en: I know of many couples who work at the same place and started dating at the orientation.

source: 어때여, 쌤.
en: what do you think, ms. kim?

source: 뭐 해?
en: What are you doing?

source: 그 시절의 당신과
en: when you...

source: 와~ 그게 벌써 몇 년 전이야.
en: Whoa, that was such a long time ago.

source: 뭐, 워낙 유명인이니 소식이야 뉴스에서 자주 접했지만
en: Well, we hear about her on the news all the time since she’s famous...

source: 나 지금 먹고 있는 브랜드 괜찮거든
en: the one I’m taking now is nice.

source: 휴
en: Whew...

source: 별이..
en: The stars...

source: 놀리는 거지?
en: you’re teasing me, aren’t you?

source: '무슨 소원을 빌었던 걸까'
en: “I wonder what she wished for.”

source: 이젠 알아요.
en: I know now.

source: 면접 끝나고 바로 운전해서 가면 아슬아슬하게 도착할 거야!
en: I think I can make it if I drive there straight from the interview!

source: 뚱~
en: HMPH
